; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	satellite7 - satellite
	instrument11 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	infrared0 - mode
	infrared3 - mode
	GroundStation3 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared3)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star0)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph4)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument11 infrared3)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star1)
	(on_board instrument11 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet9)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(pointing satellite6 Phenomenon10)
	(have_image Star5 spectrograph4)
	(have_image Star6 thermograph2)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon8 thermograph2)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 thermograph2)
))

)

; plan
1. (turn_to satellite6 phenomenon10 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 phenomenon10)
   goals met: 1 of 8
2. (turn_to satellite3 star1 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star1)
   goals met: 1 of 8
3. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 8
4. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 8
5. (turn_to satellite3 planet9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet9)
   goals met: 1 of 8
6. (take_image satellite3 planet9 instrument6 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite3 phenomenon7 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon7)
   goals met: 2 of 8
8. (turn_to satellite1 groundstation4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon7 instrument6 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 3 of 8
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 8
11. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 8
12. (turn_to satellite1 phenomenon10 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 8
13. (take_image satellite1 phenomenon10 instrument1 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 4 of 8
14. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 8
15. (take_image satellite1 phenomenon8 instrument1 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 5 of 8
16. (turn_to satellite1 star6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star6)
   goals met: 5 of 8
17. (take_image satellite1 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 6 of 8
18. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 7 of 8
19. (turn_to satellite3 star5 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star5)
   goals met: 7 of 8
20. (take_image satellite3 star5 instrument6 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 8 of 8
